balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F6720.PIC
      <edc:DCRDef edc:access="n-----nn" edc:cname="CONFIG3L" edc:default="0x83" edc:desc="" edc:impl="0x83" edc:name="CONFIG3L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x3" edc:name="RESERVED" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bits as 1s" edc:memmodeidref="microctrl" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bit as 1" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------n" edc:cname="CONFIG3H" edc:default="0x3" edc:desc="" edc:impl="0x1" edc:name="CONFIG3H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CCP2MUX" edc:desc="CCP2 Mux bit" edc:mask="0x1" edc:name="CCP2MUX" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="CCP2 input/output is multiplexed with RC1" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_CCP2MX_ON"/>
                  <edc:LegacyAlias edc:cname="_CCP2MX_ON_3H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="CCP2 input/output is multiplexed with RE7" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_CCP2MX_OFF"/>
                  <edc:LegacyAlias edc:cname="_CCP2MX_OFF_3H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n----n-n" edc:cname="CONFIG4L" edc:default="0x85" edc:desc="" edc:impl="0x85" edc:name="CONFIG4L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x85">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="STVR" edc:desc="Stack Full/Underflow Reset Enable bit" edc:mask="0x1" edc:name="STVR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Stack full/underflow will cause Reset" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Stack full/underflow will not cause Reset" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="LVP" edc:desc="Low-Voltage ICSP Enable bit" edc:mask="0x1" edc:name="LVP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Low-voltage ICSP enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Low-voltage ICSP disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable bit" edc:isidehidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Background debugger disabled. RB6 and RB7 configured as general purpose I/O pins." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Background debugger enabled. RB6 and RB7 are dedicated to In-Circuit Debug." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="1"/>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG5L" edc:default="0xff" edc:desc="" edc:impl="0xff" edc:name="CONFIG5L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CP0" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000200-003FFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000200-003FFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x200" edc:checksumalgo="0x27" edc:endaddr="0x4000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP1" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (004000-007FFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (004000-007FFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x4000" edc:checksumalgo="0x27" edc:endaddr="0x8000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP2" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (008000-00BFFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (008000-00BFFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x8000" edc:checksumalgo="0x27" edc:endaddr="0xc000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP3" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP3" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 3 (00C000-00FFFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 3 (00C000-00FFFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0xc000" edc:checksumalgo="0x27" edc:endaddr="0x10000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP4" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP4" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 4 (010000-013FFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 4 (010000-013FFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x10000" edc:checksumalgo="0x27" edc:endaddr="0x14000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP5" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP5" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 5 (014000-017FFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 5 (014000-017FFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x14000" edc:checksumalgo="0x27" edc:endaddr="0x18000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP6" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP6" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 6 (018000-01BFFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 6 (018000-01BFFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x18000" edc:checksumalgo="0x27" edc:endaddr="0x1c000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP7" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP7" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 7 (01C000-01FFFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 7 (01C000-01FFFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x1c000" edc:checksumalgo="0x27" edc:endaddr="0x20000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn------" edc:cname="CONFIG5H" edc:default="0xc0" edc:desc="" edc:impl="0xc0" edc:name="CONFIG5H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="CPB" edc:desc="Boot Block Code Protection bit" edc:mask="0x1" edc:name="CPB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block (000000-0001FFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block (000000-0001FFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x200"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPD" edc:desc="Data EEPROM Code Protection bit" edc:mask="0x1" edc:name="CPD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not code-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM code-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG6L" edc:default="0xff" edc:desc="" edc:impl="0xff" edc:name="CONFIG6L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WRT0" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000200-003FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000200-003FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT1" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (004000-007FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (004000-007FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT2" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (008000-00BFFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (008000-00BFFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT3" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT3" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 3 (00C000-00FFFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 3 (00C000-00FFFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT4" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT4" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 4 (010000-013FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 4 (010000-013FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT5" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT5" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 5 (014000-017FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 5 (014000-017FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT6" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT6" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 6 (018000-01BFFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 6 (018000-01BFFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT7" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT7" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 7 (01C000-01FFFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 7 (01C000-01FFFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnn-----" edc:cname="CONFIG6H" edc:default="0xe0" edc:desc="" edc:impl="0xe0" edc:name="CONFIG6H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="WRTC" edc:desc="Configuration Register Write Protection bit" edc:mask="0x1" edc:name="WRTC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration registers (300000-3000FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration registers (300000-3000FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTB" edc:desc="Boot Block Write Protection bit" edc:mask="0x1" edc:name="WRTB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block (000000-0001FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block (000000-0001FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTD" edc:desc="Data EEPROM Write Protection bit" edc:mask="0x1" edc:name="WRTD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG7L" edc:default="0xff" edc:desc="" edc:impl="0xff" edc:name="CONFIG7L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="EBTR0" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000200-003FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000200-003FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR1" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (004000-007FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (004000-007FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR2" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (008000-00BFFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (008000-00BFFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR3" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR3" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 3 (00C000-00FFFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 3 (00C000-00FFFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR4" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR4" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 4 (010000-013FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 4 (010000-013FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR5" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR5" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 5 (014000-017FFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 5 (014000-017FFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR6" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR6" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 6 (018000-01BFFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 6 (018000-01BFFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EBTR7" edc:desc="Table Read Protection bit" edc:mask="0x1" edc:name="EBTR7" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 7 (01C000-01FFFFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 7 (01C000-01FFFFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-n------" edc:cname="CONFIG7H" edc:default="0x40" edc:desc="" edc:impl="0x40" edc:name="CONFIG7H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x40">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="EBTRB" edc:desc="Boot Block Table Read Protection bit" edc:mask="0x1" edc:name="EBTRB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot Block (000000-0001FFh) not protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot Block (000000-0001FFh) protected from table reads executed in other blocks" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
