balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F6720.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRG2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRG2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SPBRG2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP5CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP5CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP5M" edc:desc="" edc:mask="0xf" edc:name="CCP5M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="DC5B" edc:desc="" edc:mask="0x3" edc:name="DC5B" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP5M0" edc:desc="" edc:mask="0x1" edc:name="CCP5M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP5M1" edc:desc="" edc:mask="0x1" edc:name="CCP5M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP5M2" edc:desc="" edc:mask="0x1" edc:name="CCP5M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP5M3" edc:desc="" edc:mask="0x1" edc:name="CCP5M3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC5B0" edc:desc="" edc:mask="0x1" edc:name="DC5B0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC5B1" edc:desc="" edc:mask="0x1" edc:name="DC5B1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DCCP5Y" edc:desc="" edc:mask="0x1" edc:name="DCCP5Y" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DCCP5X" edc:desc="" edc:mask="0x1" edc:name="DCCP5X" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR5" edc:desc="" edc:name="CCPR5" edc:nzwidth="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR5" edc:desc="" edc:mask="0xffff" edc:name="CCPR5" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR5L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR5L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR5L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR5L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR5H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR5H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR5H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR5H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP4CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP4CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP4M" edc:desc="" edc:mask="0xf" edc:name="CCP4M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="DC4B" edc:desc="" edc:mask="0x3" edc:name="DC4B" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP4M0" edc:desc="" edc:mask="0x1" edc:name="CCP4M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4M1" edc:desc="" edc:mask="0x1" edc:name="CCP4M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4M2" edc:desc="" edc:mask="0x1" edc:name="CCP4M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4M3" edc:desc="" edc:mask="0x1" edc:name="CCP4M3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC4B0" edc:desc="" edc:mask="0x1" edc:name="DC4B0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC4B1" edc:desc="" edc:mask="0x1" edc:name="DC4B1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DCCP4Y" edc:desc="" edc:mask="0x1" edc:name="DCCP4Y" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DCCP4X" edc:desc="" edc:mask="0x1" edc:name="DCCP4X" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR4" edc:desc="" edc:name="CCPR4" edc:nzwidth="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR4" edc:desc="" edc:mask="0xffff" edc:name="CCPR4" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR4L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR4L" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR4L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR4H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR4H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR4H" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CCPR4H" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4CON" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T4CON" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="" edc:mask="0x3" edc:name="T4CKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR4" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PR4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="7"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PORTA" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-u0u0000" edc:name="PORTA" edc:nzwidth="0x8" edc:por="-x0x0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0xff" edc:name="RA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN0" edc:desc="" edc:mask="0x1" edc:name="AN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN1" edc:desc="" edc:mask="0x1" edc:name="AN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN2" edc:desc="" edc:mask="0x1" edc:name="AN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN3" edc:desc="" edc:mask="0x1" edc:name="AN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKI" edc:desc="" edc:mask="0x1" edc:name="T0CKI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN4" edc:desc="" edc:mask="0x1" edc:name="AN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSC2" edc:desc="" edc:mask="0x1" edc:name="OSC2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="VREFM" edc:desc="" edc:mask="0x1" edc:name="VREFM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREFP" edc:desc="" edc:mask="0x1" edc:name="VREFP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LVDIN" edc:desc="" edc:mask="0x1" edc:name="LVDIN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKO" edc:desc="" edc:mask="0x1" edc:name="CLKO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
